In [11]:
#Importing dependencies
import psycopg2 as ps
import pandas as pd
import config as creds

In [12]:
def connect():
    
    # Set up a connection to the postgres server.
    conn_string = "host="+ creds.PGHOST +" port="+ "5432" +" dbname="+ creds.PGDATABASE +" user=" + creds.PGUSER \
                  +" password="+ creds.PGPASSWORD
    
    conn = ps.connect(conn_string)
    print("Connected!")
    
    # Create a cursor object
    cursor = conn.cursor()
    
    return conn, cursor

In [15]:
conn, cursor = connect()

Connected!

In [16]:
customer_df = pd.read_sql_query('SELECT * from customer_data', con=conn)
store_df = pd.read_sql_query('SELECT * from store_data', con=conn)
promo_df = pd.read_sql_query('SELECT * from promo_data', con=conn)
product_df = pd.read_sql_query('SELECT * from product_data', con=conn)
location_df = pd.read_sql_query('SELECT * from location_data', con=conn)

In [17]:
customer_df.head()

,customer_id,marital_status,gender,total_children,education,member_card,occupation,houseowner,avg_cars_at_home_approx,avg_yearly_income,num_children_at_home,location_id
0,c0,M,F,1,Partial High School,Normal,Skilled Manual,Y,1.0,$10K - $30K,1.0,loc0
1,c1,M,M,0,Bachelors Degree,Silver,Professional,Y,4.0,$50K - $70K,0.0,loc0
2,c2,S,F,4,Partial High School,Normal,Manual,N,1.0,$10K - $30K,0.0,loc0
3,c3,M,F,2,High School Degree,Bronze,Manual,Y,2.0,$30K - $50K,2.0,loc0
4,c4,M,M,0,Partial High School,Bronze,Skilled Manual,N,2.0,$30K - $50K,0.0,loc0

In [18]:
conn.close()
cursor.close()